In [21]:
from IPython.core.display import HTML
HTML('''
<script>
var logoParent = document.getElementById("kernel_logo_widget")
var logo = document.getElementById("kernel_logo_widget").getElementsByClassName("current_kernel_logo")[0];
logo.src = "https://i.ibb.co/mD4jTGQ/itclogo.jpg";
logo.style = "display: inline; width:138px; height:40px";
logoParent.innerHTML = '<a href="https://i.ibb.co/mD4jTGQ/itclogo.jpg">' + logoParent.innerHTML + '</a>';
</script>
''')

<font size="36"><b>Pandas - Assignment II</b></font> <img src = "https://s3-ap-south-1.amazonaws.com/av-blog-media/wp-content/uploads/2018/03/pandas.jpg" height=200 width=200>

Based on questions from https://www.machinelearningplus.com

In [2]:
import pandas as pd
import numpy as np

# Question #1

Turn the given array into a pandas dataframe with 5 rows and 3 columns

In [1]:
arr = np.arange(15)
pd.DataFrame(arr.reshape(5,3))

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

# Question #2

Read the data from https://raw.githubusercontent.com/selva86/datasets/master/College.csv into a pandas dataframe. Do not download the file.

Then:
 1. print the amount of columns of each datatype.
 2. Change the column name "Apps" to "Application" and print the head of the dataframe

In [4]:
data = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/College.csv', delimiter = ',')
data.info()
data.rename(columns={'Apps': 'Application'}, inplace=True)
data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 777 entries, 0 to 776
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Private      777 non-null    object
 1   Apps         777 non-null    int64
 2   Accept       777 non-null    int64
 3   Enroll       777 non-null    int64
 4   Top10perc    777 non-null    int64
 5   Top25perc    777 non-null    int64
 6   F.Undergrad  777 non-null    int64
 7   P.Undergrad  777 non-null    int64
 8   Outstate     777 non-null    int64
 9   Room.Board   777 non-null    int64
 10  Books        777 non-null    int64
 11  Personal     777 non-null    int64
 12  PhD          777 non-null    int64
 13  Terminal     777 non-null    int64
 14  S.F.Ratio    777 non-null    float64
 15  perc.alumni  777 non-null    int64
 16  Expend       777 non-null    int64
 17  Grad.Rate    777 non-null    int64
dtypes: float64(1), int64(16), object(1)
memory usage: 109.4+ KB

,Private,Application,Accept,Enroll,Top10perc,Top25perc,F.Undergrad,P.Undergrad,Outstate,Room.Board,Books,Personal,PhD,Terminal,S.F.Ratio,perc.alumni,Expend,Grad.Rate
0,Yes,1660,1232,721,23,52,2885,537,7440,3300,450,2200,70,78,18.1,12,7041,60
1,Yes,2186,1924,512,16,29,2683,1227,12280,6450,750,1500,29,30,12.2,16,10527,56
2,Yes,1428,1097,336,22,50,1036,99,11250,3750,400,1165,53,66,12.9,30,8735,54
3,Yes,417,349,137,60,89,510,63,12960,5450,450,875,92,97,7.7,37,19016,59
4,Yes,193,146,55,16,44,249,869,7560,4120,800,1500,76,72,11.9,2,10922,15

In [5]:
data.dtypes.value_counts()

int64      16
float64     1
object      1
dtype: int64

# Question #3

Read the data from https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv into a pandas dataframe. Do not download it. 
 1. How many values are missing from each of the columns?
 2. Which columns has the most missing values? (answer with code, without sorting)

In [6]:
data = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv', delimiter = ',')
null_data = data.isnull().sum()
print("The most missing values are in column '{}' with count {}\n".format(null_data.idxmax(), null_data.max()))
print(null_data)
data.info()

The most missing values are in column 'Luggage.room' with count 19

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Manufacturer        89 non-null     object
 1   Model               92 non-null     object
 2   Type                90 non-null     object
 3   Min.Price           86 non-null     float64
 4   Price               91 non-null     float64
 5   Max.Price           88 non-null     float64
 6   MPG.city            84 non-null     float64
 7   MPG.highway         91 non-null     float64
 8   AirBags             87 non-null     object
 9   DriveTrain          86 non-null     object
 10  Cylinders           88 non-null     object
 11  EngineSize          91 non-null     float64
 12  Horsepower          86 non-null     float64
 13  RPM                 90 non-null     float64
 14  Rev.per.mile        87 non-null     float64
 15  Man.trans.avail     88 non-null     object
 16  Fuel.tank.capacity  85 non-null     float64
 17  Passengers          91 non-null     float64
 18  Length              89 non-null     float64
 19  Wheelbase           92 non-null     float64
 20  Width               87 non-null     float64
 21  Turn.circle         88 non-null     float64
 22  Rear.seat.room      89 non-null     float64
 23  Luggage.room        74 non-null     float64
 24  Weight              86 non-null     float64
 25  Origin              88 non-null     object
 26  Make                90 non-null     object
dtypes: float64(18), object(9)
memory usage: 19.7+ KB

# Question #4

Using the dataframe from Question #3, fill all of the missing values in the "Manufacturer" column with the word "Unknown".

In [7]:
print(data["Manufacturer"].fillna('Unknown', inplace=True))

None

In [8]:
data["Manufacturer"].isna().sum()

0

Print the unique values of the column.

In [9]:
data.Manufacturer.unique()

array(['Acura', 'Unknown', 'Audi', 'BMW', 'Buick', 'Cadillac',
       'Chevrolet', 'Chrysler', 'Dodge', 'Eagle', 'Ford', 'Geo', 'Honda',
       'Hyundai', 'Infiniti', 'Lexus', 'Lincoln', 'Mazda',
       'Mercedes-Benz', 'Mercury', 'Mitsubishi', 'Nissan', 'Oldsmobile',
       'Plymouth', 'Pontiac', 'Saab', 'Saturn', 'Subaru', 'Suzuki',
       'Toyota', 'Volkswagen', 'Volvo'], dtype=object)

# Question #5a

Using the dataframe from Question #3 
 1. Print maximum value of the column.
 2. Print how many cars are there with this value
 3. Get the row number, of the **first instance** of largest value in the column "EngineSize". 
 4. Print the row you got

In [10]:
# data = data.reset_index()
the_max_value = data['EngineSize'].max()
print("The maximum value in the column 'EngineSize' is {}\n".format(the_max_value))

count_cars_max_val = len(data[data['EngineSize'] == the_max_value].index)
print("There are {} cars with maximum value {} in column 'EngineSize' \n".format(count_cars_max_val,the_max_value))

row_num_1_occur_max = data['EngineSize'].idxmax()
print("The row number of first instance of largest value in the column 'EngineSize'  is {}  \n".format(row_num_1_occur_max))

the_row_i_got =  data.loc[data['EngineSize'].idxmax()]
print("Look at the row we got now:\n\n{}".format(the_row_i_got))

The maximum value in the column 'EngineSize' is 5.7

There are 2 cars with maximum value 5.7 in column 'EngineSize'

The row number of first instance of largest value in the column 'EngineSize'  is 7

Look at the row we got now:

Manufacturer                     Buick
Model                       Roadmaster
Type                             Large
Min.Price                         22.6
Price                             23.7
Max.Price                         24.9
MPG.city                            16
MPG.highway                         25
AirBags                    Driver only
DriveTrain                        Rear
Cylinders                            6
EngineSize                         5.7
Horsepower                         180
RPM                               4000
Rev.per.mile                      1320
Man.trans.avail                     No
Fuel.tank.capacity                  23
Passengers                           6
Length                             216
Wheelbase                          116
Width                               78
Turn.circle                         45
Rear.seat.room                    30.5
Luggage.room                        21
Weight                            4105
Origin                             USA
Make                  Buick Roadmaster
Name: 7, dtype: object

# Question #5b

Using the dataframe from Question #3: 
 
Write generic code that prints all the rows with x-th largest **unique** EngineSize (**starting from 0** - 0 being the largest, 1 - 2nd largest etc.).  Use this code to find the 2nd largest (parameter = 1) unique EngineSize.

In [11]:


def print_row_xth_unique_max_engine(i):
    display(data[data['EngineSize']==pd.Series(data['EngineSize'].unique()).nlargest(i+1).values[-1]])
    
# don't change code from here
print_row_xth_unique_max_engine(1)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
17,Chevrolet,Caprice,Large,18.0,18.8,19.6,17.0,26.0,Driver only,Rear,...,6.0,214.0,116.0,77.0,42.0,29.5,20.0,3910.0,USA,Chevrolet Caprice



# Question #5c

Using the dataframe from Question #3: 

Print the rows with 3th (**starting from 0**) largest EngineSize (non-unique, if there are numerous rows with same engine size, they are considered separate largest engine sizes for the purpose of this question)

In [12]:
def print_row_xth_max_engine(i):
    display(data[data['EngineSize'] == data['EngineSize'].nlargest(i+1).values[-1]])
# don't change code from here
print_row_xth_max_engine(3)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
9,Cadillac,DeVille,Large,33.0,34.7,36.3,16.0,25.0,Driver only,Front,...,6.0,206.0,114.0,73.0,43.0,35.0,18.0,3620.0,USA,Cadillac DeVille

# Question #6

Join two dataframes by two columns, so they have only the common rows. Remove duplicate columns (meaning that all values are the same) to keep only one column.  For `price` column, give 2 versions of prices with names `price_1` and `price_2`

In [13]:
df_q6_1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df_q6_2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

merged_inner = pd.merge(df_q6_1, df_q6_2,left_on=['fruit','weight'], right_on=['pazham','kilo'], how='inner')
merged_inner.drop(columns = ['pazham', 'kilo'], axis=1, inplace=True)
merged_inner.rename(columns={"price_x": "price_1", "price_y": "price_2"}, inplace=True)
display(merged_inner)

    fruit weight  price_1  price_2
0   apple   high        7        2
1   apple   high       11        2
2   apple   high        1        2
3  orange    low        7        1
4  orange    low       11        1
5  orange    low        7        1

# Question #7

Split the string column in a dataframe to form a dataframe with 3 columns named  "STD", "City", and "State"

In [14]:
df_q7 = pd.DataFrame(["STD,City\tState",
                        "33,Kolkata\tWest Bengal",
                        "44,Chennai\tTamil Nadu",
                        "40,Hyderabad\tTelengana",
                        "80,Bangalore\tKarnataka"], columns=['row'])

df_q7
# Desired Output:
#   STD        City        State
# 0  33     Kolkata  West Bengal
# 1  44     Chennai   Tamil Nadu
# 2  40   Hyderabad    Telengana
# 3  80   Bangalore    Karnataka

df = df_q7['row'].str.split('[,\\t]')
df_t = pd.concat([pd.Series(df[1]), pd.Series(df[2]), pd.Series(df[3]), pd.Series(df[4])],axis=1).T
df_t.columns = df[0][:]
display(df_t)

  STD       City        State
0  33    Kolkata  West Bengal
1  44    Chennai   Tamil Nadu
2  40  Hyderabad    Telengana
3  80  Bangalore    Karnataka

# Question #8

Using the dataframe from Question #3, delete the columns: "EngineSize" and "Length". Do it in two different ways. Check (with code) that these columns are indeed gone.

In [15]:
data_8 = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
data_8.drop(['EngineSize','Length'], axis=1, inplace=True)
flag1 = 'EngineSize' and 'Length' in data_8

data_8_1 = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
del data_8_1['EngineSize']
del data_8_1['Length']
flag2 = 'EngineSize' and 'Length' in data_8_1

print(flag1, flag2)

False False

# Question #9

Unpivot the given pandas dataframe from a wide firmat to a long format. 
(Hint: Explore the melt function)

In [16]:
df_q9 = pd.DataFrame({'Name': {0: 'Danielle', 1: 'Dani', 2: 'Lior'}, 
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'}, 
                   'Age': {0: 28, 1: 29, 2: 30}}) 

#Expected outcome:
#    Name     Variable Value
# 0  Danielle Course   Masters
# 1  Dani     Course   Graduate
# 2  Lior     Course   Graduate
# 3  Danielle Age      28
# 4  Dani     Age      29
# 5  Lior     Age      30

display(df_q9)
df = pd.melt(df_q9, id_vars=['Name'],value_vars=df_q9.columns[1:])
df

       Name    Course  Age
0  Danielle   Masters   28
1      Dani  Graduate   29
2      Lior  Graduate   30

       Name variable     value
0  Danielle   Course   Masters
1      Dani   Course  Graduate
2      Lior   Course  Graduate
3  Danielle      Age        28
4      Dani      Age        29
5      Lior      Age        30

# Question #10

Take the outcome dataframe from Question #9 and return it to it's original form (with pivoting)

In [17]:
df10 = df.pivot(index='Name',columns='variable',values='value').reset_index()
display(df10.columns)

Index(['Name', 'Age', 'Course'], dtype='object', name='variable')

In [18]:
df10.columns.name = None

In [19]:
display(df10.columns)

Index(['Name', 'Age', 'Course'], dtype='object')

In [20]:
df10

       Name Age    Course
0      Dani  29  Graduate
1  Danielle  28   Masters
2      Lior  30  Graduate